notes/meeting_2022jan02.org
* meeting notes January 02, 2022
** the raku study group
*** Raku your data, roll your thoughts

** usual links
*** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022jan02.md 
*** https://github.com/doomvox/raku-study/bin/2022jan02

** topicettes

*** custom associatives
**** https://stackoverflow.com/questions/63050032/can-i-write-an-object-that-behaves-like-a-hash/63059286#63059286


*** new work on thread libraries for perl5
**** https://metacpan.org/pod/Thread::Csp
**** https://www.reddit.com/r/perl/comments/rrayau/new_threading_library_for_perl/
**** commnicating sequential processes
***** https://en.wikipedia.org/wiki/Communicating_sequential_processes
***** https://www.cs.cmu.edu/~crary/819-f09/Hoare78.pdf

*** jonathan worthington, cro-ing
**** https://raku-advent.blog/2021/12/19/let-it-cro/

*** future topicettes:
**** getting sets to DWIM
https://donaldh.wtf/2021/01/if-sets-would-dwim/

** announcments 
*** January 6th: svlug: I'll be talking about Raku
**** https://www.meetup.com/SVPerl/events/xjdzdsydccbjb/

*** January 16th: next raku study group meeting

***  February 5-6: FOSDEM Raku talks
**** https://www.reddit.com/r/rakulang/comments/rsua3p/raku_talks_at_fosdem/
