notes/meeting_2022jan02.md
- [meeting notes January 02, 2022](#org768664a)
  - [the raku study group](#org9a3d7ce)
    - [Raku your data, roll your thoughts](#org18d6d3f)
  - [usual links](#orgc1d9183)
    - [<https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022jan02.md>](#orgdb1cf3a)
    - [<https://github.com/doomvox/raku-study/bin/2022jan02>](#orgcab83f4)
  - [topicettes](#orgd5c9801)
    - [custom associatives](#org064392e)
    - [new work on thread libraries for perl5](#org8d6560e)
    - [jonathan worthington, cro-ing](#orgc180037)
    - [future topicettes:](#orgaf482ec)
  - [announcments](#org838b15e)
    - [January 6th: svlug: I'll be talking about Raku](#org2ebb64f)
    - [January 16th: next raku study group meeting](#org8332fb8)
    - [February 5-6: FOSDEM Raku talks](#org28b953f)


<a id="org768664a"></a>

# meeting notes January 02, 2022


<a id="org9a3d7ce"></a>

## the raku study group


<a id="org18d6d3f"></a>

### Raku your data, roll your thoughts


<a id="orgc1d9183"></a>

## usual links


<a id="orgdb1cf3a"></a>

### <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022jan02.md>


<a id="orgcab83f4"></a>

### <https://github.com/doomvox/raku-study/bin/2022jan02>


<a id="orgd5c9801"></a>

## topicettes


<a id="org064392e"></a>

### custom associatives

1.  <https://stackoverflow.com/questions/63050032/can-i-write-an-object-that-behaves-like-a-hash/63059286#63059286>


<a id="org8d6560e"></a>

### new work on thread libraries for perl5

1.  <https://metacpan.org/pod/Thread::Csp>

2.  <https://www.reddit.com/r/perl/comments/rrayau/new_threading_library_for_perl/>

3.  commnicating sequential processes

    1.  <https://en.wikipedia.org/wiki/Communicating_sequential_processes>
    
    2.  <https://www.cs.cmu.edu/~crary/819-f09/Hoare78.pdf>


<a id="orgc180037"></a>

### jonathan worthington, cro-ing

1.  <https://raku-advent.blog/2021/12/19/let-it-cro/>


<a id="orgaf482ec"></a>

### future topicettes:

1.  getting sets to DWIM

    <https://donaldh.wtf/2021/01/if-sets-would-dwim/>


<a id="org838b15e"></a>

## announcments


<a id="org2ebb64f"></a>

### January 6th: svlug: I'll be talking about Raku

1.  <https://www.meetup.com/SVPerl/events/xjdzdsydccbjb/>


<a id="org8332fb8"></a>

### January 16th: next raku study group meeting


<a id="org28b953f"></a>

### February 5-6: FOSDEM Raku talks

1.  <https://www.reddit.com/r/rakulang/comments/rsua3p/raku_talks_at_fosdem/>
